// Generated by jextract

package org.python;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     PyObject ob_base;
 *     Py_ssize_t ma_used;
 *     uint64_t ma_version_tag;
 *     PyDictKeysObject *ma_keys;
 *     PyDictValues *ma_values;
 * }
 * }
 */
public class PyDictObject {

    PyDictObject() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        _object.layout().withName("ob_base"),
        Python_h.C_LONG.withName("ma_used"),
        Python_h.C_LONG_LONG.withName("ma_version_tag"),
        Python_h.C_POINTER.withName("ma_keys"),
        Python_h.C_POINTER.withName("ma_values")
    ).withName("$anon$11:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout ob_base$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ob_base"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PyObject ob_base
     * }
     */
    public static final GroupLayout ob_base$layout() {
        return ob_base$LAYOUT;
    }

    private static final long ob_base$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PyObject ob_base
     * }
     */
    public static final long ob_base$offset() {
        return ob_base$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PyObject ob_base
     * }
     */
    public static MemorySegment ob_base(MemorySegment struct) {
        return struct.asSlice(ob_base$OFFSET, ob_base$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PyObject ob_base
     * }
     */
    public static void ob_base(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ob_base$OFFSET, ob_base$LAYOUT.byteSize());
    }

    private static final OfLong ma_used$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ma_used"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Py_ssize_t ma_used
     * }
     */
    public static final OfLong ma_used$layout() {
        return ma_used$LAYOUT;
    }

    private static final long ma_used$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Py_ssize_t ma_used
     * }
     */
    public static final long ma_used$offset() {
        return ma_used$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Py_ssize_t ma_used
     * }
     */
    public static long ma_used(MemorySegment struct) {
        return struct.get(ma_used$LAYOUT, ma_used$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Py_ssize_t ma_used
     * }
     */
    public static void ma_used(MemorySegment struct, long fieldValue) {
        struct.set(ma_used$LAYOUT, ma_used$OFFSET, fieldValue);
    }

    private static final OfLong ma_version_tag$LAYOUT = (OfLong)$LAYOUT.select(groupElement("ma_version_tag"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t ma_version_tag
     * }
     */
    public static final OfLong ma_version_tag$layout() {
        return ma_version_tag$LAYOUT;
    }

    private static final long ma_version_tag$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t ma_version_tag
     * }
     */
    public static final long ma_version_tag$offset() {
        return ma_version_tag$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t ma_version_tag
     * }
     */
    public static long ma_version_tag(MemorySegment struct) {
        return struct.get(ma_version_tag$LAYOUT, ma_version_tag$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t ma_version_tag
     * }
     */
    public static void ma_version_tag(MemorySegment struct, long fieldValue) {
        struct.set(ma_version_tag$LAYOUT, ma_version_tag$OFFSET, fieldValue);
    }

    private static final AddressLayout ma_keys$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ma_keys"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PyDictKeysObject *ma_keys
     * }
     */
    public static final AddressLayout ma_keys$layout() {
        return ma_keys$LAYOUT;
    }

    private static final long ma_keys$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PyDictKeysObject *ma_keys
     * }
     */
    public static final long ma_keys$offset() {
        return ma_keys$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PyDictKeysObject *ma_keys
     * }
     */
    public static MemorySegment ma_keys(MemorySegment struct) {
        return struct.get(ma_keys$LAYOUT, ma_keys$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PyDictKeysObject *ma_keys
     * }
     */
    public static void ma_keys(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ma_keys$LAYOUT, ma_keys$OFFSET, fieldValue);
    }

    private static final AddressLayout ma_values$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ma_values"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PyDictValues *ma_values
     * }
     */
    public static final AddressLayout ma_values$layout() {
        return ma_values$LAYOUT;
    }

    private static final long ma_values$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PyDictValues *ma_values
     * }
     */
    public static final long ma_values$offset() {
        return ma_values$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PyDictValues *ma_values
     * }
     */
    public static MemorySegment ma_values(MemorySegment struct) {
        return struct.get(ma_values$LAYOUT, ma_values$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PyDictValues *ma_values
     * }
     */
    public static void ma_values(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ma_values$LAYOUT, ma_values$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

