// Generated by jextract

package org.python;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct PyStructSequence_Desc {
 *     const char *name;
 *     const char *doc;
 *     PyStructSequence_Field *fields;
 *     int n_in_sequence;
 * }
 * }
 */
public class PyStructSequence_Desc {

    PyStructSequence_Desc() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Python_h.C_POINTER.withName("name"),
        Python_h.C_POINTER.withName("doc"),
        Python_h.C_POINTER.withName("fields"),
        Python_h.C_INT.withName("n_in_sequence"),
        MemoryLayout.paddingLayout(4)
    ).withName("PyStructSequence_Desc");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final AddressLayout doc$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("doc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *doc
     * }
     */
    public static final AddressLayout doc$layout() {
        return doc$LAYOUT;
    }

    private static final long doc$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *doc
     * }
     */
    public static final long doc$offset() {
        return doc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *doc
     * }
     */
    public static MemorySegment doc(MemorySegment struct) {
        return struct.get(doc$LAYOUT, doc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *doc
     * }
     */
    public static void doc(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(doc$LAYOUT, doc$OFFSET, fieldValue);
    }

    private static final AddressLayout fields$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("fields"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PyStructSequence_Field *fields
     * }
     */
    public static final AddressLayout fields$layout() {
        return fields$LAYOUT;
    }

    private static final long fields$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PyStructSequence_Field *fields
     * }
     */
    public static final long fields$offset() {
        return fields$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PyStructSequence_Field *fields
     * }
     */
    public static MemorySegment fields(MemorySegment struct) {
        return struct.get(fields$LAYOUT, fields$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PyStructSequence_Field *fields
     * }
     */
    public static void fields(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(fields$LAYOUT, fields$OFFSET, fieldValue);
    }

    private static final OfInt n_in_sequence$LAYOUT = (OfInt)$LAYOUT.select(groupElement("n_in_sequence"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int n_in_sequence
     * }
     */
    public static final OfInt n_in_sequence$layout() {
        return n_in_sequence$LAYOUT;
    }

    private static final long n_in_sequence$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int n_in_sequence
     * }
     */
    public static final long n_in_sequence$offset() {
        return n_in_sequence$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int n_in_sequence
     * }
     */
    public static int n_in_sequence(MemorySegment struct) {
        return struct.get(n_in_sequence$LAYOUT, n_in_sequence$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int n_in_sequence
     * }
     */
    public static void n_in_sequence(MemorySegment struct, int fieldValue) {
        struct.set(n_in_sequence$LAYOUT, n_in_sequence$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

